const data = {
    "国崎":{
        "売上": {},

        "原価": {
            "月ズレ": [
                {"金額": 0.4, "好転":false, "説明":["上下水", "1"]},
                {"金額": 0.2, "好転":false, "説明":["消石灰", "1"]},
                {"金額": 1.3, "好転":false, "説明":["キレート", "1"]},
                {"金額": 0.7, "好転":false, "説明":["運転委託購入品", "3"]},
                {"金額": 0.2, "好転":false, "説明":["駆動装置用伸縮継手取替", "1"]},
                {"金額": 0.6, "好転":false, "説明":["ボイラフィン、シールBOX補修", "1"]},
                {"金額": 1.8, "好転":false, "説明":["性能試験", "1"]},
                {"金額": 0.5, "好転":true,  "説明":["苛性ソーダ", "3"]},
                {"金額": 2.3, "好転":true,  "説明":["ごみクレーン整備", "3"]},
                {"金額": 4.4, "好転":true,  "説明":["2号ろ過集塵機パルス配管改造", "3"]},
                {"金額": 5.2, "好転":true,  "説明":["非常用照明交換", "1"]},
                {"金額": 4.9, "好転":true,  "説明":["産廃処理費", "1"]},
                {"金額": 0.5, "好転":true,  "説明":["植栽", "1"]},
                {"金額": 0.4, "好転":true,  "説明":["酸素ボンベ", "3"]}
            ],

            "純増減": [
                {"金額": 0.8, "好転":false, "説明":["電力", "2炉運転→1炉運転により基本料金増"]},
                {"金額": 2.7, "好転":false, "説明":["ガス", "灰溶融原単位悪化　400m3/t→480m3/t"]},
                {"金額": 1.0, "好転":false, "説明":["スラグ運搬", "搬出量増"]},
                {"金額": 4.2, "好転":false, "説明":["ショベルローダ2台、リフト2台部品交換増"]},
                {"金額": 0.2, "好転":false, "説明":["工費", "所長・室長次期包括準備対応増"]},
                {"金額": 2.3, "好転":true,  "説明":["メンテ工数", "他工場支援で不在の為"]},
                {"金額": 1.5, "好転":true,  "説明":["ボイラ設計工数"]},
                {"金額": 0.4, "好転":true,  "説明":["備品購入減"]}
            ]
        }
    }
}

//const data = JSON.parse(json);

const tsukizure = data.国崎.原価.月ズレ;

const tukizureTotal = tsukizure.reduce((sum, item) => {
    return sum + (item.好転 ? 1 : -1) * Math.round(item.金額 * 10);
}, 0) / 10;

const disc = data.国崎.原価.月ズレ.map(item => `　　${(item.好転 ? "＋":"▲")}${item.金額.toFixed(1)}　${item.説明[0]}（${item.説明[1]}→2月）`);

console.log(`【原価】`);
console.log(`　（月ズレ）　${tukizureTotal.toFixed(1)}`);
console.log(disc.join("\n"));